<h1>С и С++</h1>
<h2>Чем отличаются C и C++?</h2>
<p>
С++ унаследовал возможности языка C. Строго говоря, C++ является расшире- нием языка С: любая конструкция на языке C является корректной в C++;
 в то же время обратное неверно. Наиболее значительные нововведения, присутст- вующие в C++, касаются классов, объектов и ООП (первоначальное
 название языка C++ — «С с классами»). Тем не менее имеются и другие усовершенствова- ния, связанные со способами организации ввода/вывода
 и написанием коммен- тариев. Иллюстрация отношения между языками C и C++ приведена на рисунке из книги Лафоре ООП
 
 
 </p>
 
 <img src="/img/c++img/c&c++.jpg" width="189" height="255" alt="lorem">
 
 <p>
 С++ является расширением языка C, позволяющим реализовать концепцию ООП, а также включающим в себя некоторые дополнительные возможности.
 Часть средств языка C, несмотря на их поддержку C++, признаны устаревшими в контексте новых подходов к программированию и потому употребляются 
 ред- ко, как правило, заменяясь более новыми средствами C++. В результате разли- чия между C и C++ оказываются более значительными, чем кажется
 на первый взгляд. 
На практике существует гораздо больше различий между C и C++, чем мо- жет показаться вначале. Несмотря на то что можно писать программы на C++,
 внешне напоминающие программы на C, вряд ли кому-то придет в голову так поступать. Программисты, использующие C++, не только пользуются преимуществами
 этого языка перед C, но и по-новому используют возможности, уна- следованные от C. 
 </p>