<?php
<h1>OOP C++</h1>
<h2>Что такое OOP</h2>
<p>
ООП является способом организации программы. Основное внимание при его изучении уделяется организации программы, а не вопросам написания кода.
 Главным компонентом объектно-ориентированной программы является объект, содержащий данные и функции для их обработки. Класс является формой
 или образцом для множества сходных между собой объектов. Механизм наследования позволяет создавать новые классы на основе суще- ствующих классов,
 не внося изменений в последние. Порожденный класс насле- дует все данные и методы своего родителя, но имеет также и свои собственные.
 Наследование делает возможным повторное использование кода, то есть вклю- чение однажды созданного класса в любые другие программы. 
 </p>
 ?>