<h1>Обо мне</h1>
<h2></h2>
<p>

</p>


<h2>Почему программирование?</h2>
<p>
У каждого человека есть свое увлечение, кому то нравится смотреть футбол, пить пиво, рисовать, ковыряться в машине или 
играть в шахматы, нарды или в видеоигры. Сразу хочу сказать, что я не фанат футбола и уж тем более не фанат нашей российской сборной.
Не пью даже пиво, так как предпочитаю оставаться в здравом уме, поэтому лучше пробежать пару киллометров или сходить в спортзал,
получить не меньше удовольствия и заряд бодрости на весь день, чем потом весь день отходить и дышать на всех перегаром. Мне нравится рисовать
или играть в видеоигры, но это определенно это не принесет мне пользы, к тому же я вышел из этого возраста. Чинить машины я тоже люблю, но так уж получилось,
что у меня нет своего гаража, а работать в автосервисе как лошадь, потом пахнуть бензином и хранить мазуту под ногтями какой нибудь хонды или вольво,
тоже нет желания (знаю, пробовал), мазута отмывается бензином, но под ногтями грязь хранится минимум неделю, как данные в куки файлах :).
Программирование - это то, что мне нравится, это то что, определенно приносит мне пользу, программирование не хило развивает логическое мышление, если
программирование превратится из хобби в работу, это будет приносить не хилый доход. Я часто связываю объекты из жизни с объектно ориентированным
программированием. Программирование есть объекты из жизни, их свойства и функции. Например есть структура фирмы, в ней есть объекты отдел кадров,
бухгалтерия, логистический отдел. У каждого из этих объектов есть свои своства и функции. Например у бухгалтера есть функция получить запрос(приказ),
и есть функция выдать зарплату. Все эти объекты связаны друг с другом. Как например в программировании один класс наследует от другого класса.
Если например рассматривать объект покупатель, то у него есть массив потребностей и функция купить. У продавца есть функция перебирать массив этих потребностей,
выявлять наиболее подходящие под свойства товара и включать функцию презентация товара, которая будет перечислять свойства этого наиболее подходящего товара.
Программист это не только язык программирвония, например программист 1С должен помимо языка 1С, знать основы бухгалтерского учета или кассовых операций,
ему не редко приходится взаимодействовать с разными отделами структуры. Программирование это не один язык программирования, например, вебпрограммисту, чтобы
сделать простой сайт, достаточно знать html и css, но, чтобы реализовать красивый сайт, который будет двигаться, работать и приносить доход, кроме html
и css нужно знать, другие языки программировае, обычно это php и javaScript, sql запросы к базе данных, и кучу полезных фреймворков. Мало сделать сайт,
пожалуй это даже просто, так как на данный момент времени существует много конструкторов сайта, (так сказать монополия) доступных обычному пользователю,
но чтобы сайт по настоящему работал и приносил доход, нужно знать, что такое SEO, постоянно работать над этим сайтом, вносить в него изменения под нужды поситителей сайта, продвигать 
его в поиске, работать над его маркетингом.


</p>